app/views/ios_app/index.html.erb

		<td><%= app.description %></td>
		<td><%= AppCapacity.find(app.capacity).name %></td>
---
SELECT `app_capacities`.* FROM `app_capacities` WHERE `app_capacities`.`id` = 19 LIMIT 1