app/controllers/android_app_controller.rb

SELECT `android_apps`.* FROM `android_apps`
---
	def index
		@androidapps = AndroidApp.all

INSERT INTO `android_apps` (`capacity`, `created_at`, `description`, `filename`, `name`, `updated_at`) VALUES (5, '2012-09-29 10:03:55', 'Temp Run', '2012_09_29_18_03_55_221.png', 'Temp Run', '2012-09-29 10:03:55')
---
	def create
		unless request.get?
			filename=upload_file(params[:android_app]['filename'])

			@androidapp = AndroidApp.new(params[:android_app])
			@androidapp.filename = filename
  			@androidapp.save

SELECT `android_apps`.* FROM `android_apps` WHERE `android_apps`.`id` = 3 LIMIT 1
SELECT `app_capacities`.* FROM `app_capacities` WHERE `app_capacities`.`id` = 19 LIMIT 1
---
	def show
		@androidapp = AndroidApp.find(params[:id])
		@capacity = AppCapacity.find(@androidapp.capacity)

SELECT `android_apps`.* FROM `android_apps` WHERE `android_apps`.`id` = 3 LIMIT 1
---
	def edit
		@androidapp = AndroidApp.find(params[:id])

SELECT `android_apps`.* FROM `android_apps` WHERE `android_apps`.`id` = 3 LIMIT 1
UPDATE `android_apps` SET `description` = '极品飞车15 android版 漂移的感觉很不错哟', `updated_at` = '2012-09-28 08:55:36' WHERE `android_apps`.`id` = 3
---
	def update
		@androidapp = AndroidApp.find(params[:id])
  		@androidapp.update_attributes(params[:android_app])