app/controllers/app_capacity_controller.rb

SELECT `app_capacities`.* FROM `app_capacities`
---
	def index
		@capacities = AppCapacity.all

SELECT `app_capacities`.* FROM `app_capacities` WHERE `app_capacities`.`id` = 1 LIMIT 1
---
	def show
		@capacity = AppCapacity.find(params[:id])

SELECT `app_capacities`.* FROM `app_capacities` WHERE `app_capacities`.`id` = 2 LIMIT 1
---
	def edit
		@capacity = AppCapacity.find(params[:id])

SELECT `app_capacities`.* FROM `app_capacities` WHERE `app_capacities`.`id` = 1 LIMIT 1
DELETE FROM `app_capacities` WHERE `app_capacities`.`id` = 1
---
	def destroy
		@capacity = AppCapacity.find(params[:id])
  		@capacity.destroy

INSERT INTO `app_capacities` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2012-09-28 04:07:00', NULL, NULL, '2012-09-28 04:07:00')
---
	def create
		@capacity = AppCapacity.new(params[:app_capacity])
  		@capacity.save

SELECT `app_capacities`.* FROM `app_capacities` WHERE `app_capacities`.`id` = 2 LIMIT 1
UPDATE `app_capacities` SET `description` = 'aaaaaaaa', `updated_at` = '2012-09-28 05:31:17' WHERE `app_capacities`.`id` = 2
---
	def update
  		@capacity = AppCapacity.find(params[:id])
  		@capacity.update_attributes(params[:app_capacity])