app/controllers/home_controller.rb

  def index
  	@iosapps = IosApp.all
---
SELECT `ios_apps`.* FROM `ios_apps`