app/controllers/ios_app_controller.rb

	def index
		@iosapps = IosApp.all
---
SELECT `ios_apps`.* FROM `ios_apps`

	def create
		unless request.get?
       		filename=upload_file(params[:ios_app]['filename'])
       		@iosapp = IosApp.new(params[:ios_app])
       		@iosapp.filename = filename
  			@iosapp.save
---
INSERT INTO `ios_apps` (`capacity`, `created_at`, `description`, `filename`, `name`, `updated_at`) VALUES (5, '2012-09-29 09:46:25', 'Temple Run', '2012_09_29_17_46_25_221.png', 'Temple Run', '2012-09-29 09:46:25')

	def show
		@iosapp = IosApp.find(params[:id])
		@capacity = AppCapacity.find(@iosapp.capacity)
---
SELECT `ios_apps`.* FROM `ios_apps` WHERE `ios_apps`.`id` = 2 LIMIT 1
SELECT `app_capacities`.* FROM `app_capacities` WHERE `app_capacities`.`id` = 19 LIMIT 1

	def edit
		@iosapp = IosApp.find(params[:id])
---
SELECT `ios_apps`.* FROM `ios_apps` WHERE `ios_apps`.`id` = 3 LIMIT 1

	def update
		unless request.get?
			filename=upload_file(params[:ios_app]['filename'])
			@iosapp = IosApp.find(params[:id])
			# @iosapp.filename = filename
			hash = Hash.new
			hash['name'] = params[:ios_app]['name']
			hash['description'] = params[:ios_app]['description']
			hash['capacity'] = params[:ios_app]['capacity']
			hash['filename'] = filename
  			@iosapp.update_attributes(hash)
---
SELECT `ios_apps`.* FROM `ios_apps` WHERE `ios_apps`.`id` = 2 LIMIT 1
UPDATE `ios_apps` SET `filename` = '2012_10_08_10_35_41_221.png', `updated_at` = '2012-10-08 02:35:41' WHERE `ios_apps`.`id` = 4

	def destroy
		@iosapp = IosApp.find(params[:id])
  		@iosapp.destroy
---
SELECT `ios_apps`.* FROM `ios_apps` WHERE `ios_apps`.`id` = 1 LIMIT 1
DELETE FROM `ios_apps` WHERE `ios_apps`.`id` = 1