app/views/android_app/edit.html.erb

			<td><%= f.label :capacity, "Capacity" %></td>
			<td><%= f.select :capacity, @capacities %></td>
---
SELECT `app_capacities`.* FROM `app_capacities`