app/views/android_app/index.html.erb

SELECT `app_capacities`.* FROM `app_capacities` WHERE `app_capacities`.`id` = 19 LIMIT 1
---
		<td><%= app.description %></td>
		<td><%= AppCapacity.find(app.capacity).name %></td>