app/views/android_app/new.html.erb

SELECT `app_capacities`.* FROM `app_capacities`
---
			<td><%= f.label :capacity, "Capacity" %></td>
			<td><%= f.select :capacity, @capacities %></td>